<a href="https://colab.research.google.com/github/sumayabai/Book-Recommendation-System/blob/main/Book_Recommendation_system.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#import the neccesary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
#loading the users data
users_df = pd.read_csv('/content/drive/My Drive/Capstone 4/Users.csv')

In [4]:
#loading the ratings data
ratings_df = pd.read_csv('/content/drive/My Drive/Capstone 4/Ratings.csv')

In [5]:
#loading the Books data
books_df = pd.read_csv('/content/drive/My Drive/Capstone 4/Books.csv')

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

# Data Preprocessing of Users dataset

In [15]:
users_df.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [6]:
users_df.shape

(278858, 3)

In [11]:
users_df.dtypes

User-ID       int64
Location     object
Age         float64
dtype: object

In [19]:
users_df['User-ID'].values

array([     1,      2,      3, ..., 278856, 278857, 278858])

In [21]:
users_df['Age'].values

array([nan, 18., nan, ..., nan, nan, nan])

In [22]:
#plot the age value to have a better understanding of the outlier

In [ ]:
ratings_df.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [ ]:
books_df.head()

         ISBN  ...                                        Image-URL-L
0  0195153448  ...  http://images.amazon.com/images/P/0195153448.0...
1  0002005018  ...  http://images.amazon.com/images/P/0002005018.0...
2  0060973129  ...  http://images.amazon.com/images/P/0060973129.0...
3  0374157065  ...  http://images.amazon.com/images/P/0374157065.0...
4  0393045218  ...  http://images.amazon.com/images/P/0393045218.0...

[5 rows x 8 columns]

In [ ]:
#size of the dataset 

print(f'''\t  users_df size is {users_df.shape}
          ratings_df size is {ratings_df.shape}
          books_df size is {books_df.shape}''')

	  users_df size is (278858, 3)
          ratings_df size is (1149780, 3)
          books_df size is (271360, 8)

In [ ]:
#check for missing values
def missing_zero_values_table(df):
    mis_val=df.isnull().sum()
    mis_val_percent=round(df.isnull().mean().mul(100),2)
    mz_table=pd.concat([mis_val,mis_val_percent],axis=1)
    mz_table=mz_table.rename(
    columns={df.index.name:'col_name',0:'Missing Values',1:'% of Total Values'})
    mz_table['Data_type']=df.dtypes
    mz_table=mz_table.sort_values('% of Total Values',ascending=False)
    print(f"Your selected dataframe has "+str(df.shape[1])+" columns and "+str(df.shape[0])+" Rows.\n"
         "There are "+str(mz_table[mz_table.iloc[:,1] != 0].shape[0])+
          " columns that have missing values.")
    return mz_table.reset_index()

In [ ]:
missing_zero_values_table(users_df)

Your selected dataframe has 3 columns and 278858 Rows.
There are 1 columns that have missing values.

      index  Missing Values  % of Total Values Data_type
0       Age          110762              39.72   float64
1   User-ID               0               0.00     int64
2  Location               0               0.00    object

In [ ]:
missing_zero_values_table(ratings_df)

Your selected dataframe has 3 columns and 1149780 Rows.
There are 0 columns that have missing values.

         index  Missing Values  % of Total Values Data_type
0      User-ID               0                0.0     int64
1         ISBN               0                0.0    object
2  Book-Rating               0                0.0     int64

In [ ]:
missing_zero_values_table(books_df)

Your selected dataframe has 8 columns and 271360 Rows.
There are 0 columns that have missing values.

                 index  Missing Values  % of Total Values Data_type
0                 ISBN               0                0.0    object
1           Book-Title               0                0.0    object
2          Book-Author               1                0.0    object
3  Year-Of-Publication               0                0.0    object
4            Publisher               2                0.0    object
5          Image-URL-S               0                0.0    object
6          Image-URL-M               0                0.0    object
7          Image-URL-L               3                0.0    object